#pragma once

//пътя до файла , в който ще пазим всичката информация
#define FILE_NAME "students.bin"

//най - висока възможна оценка
double const MAXGRADE = 6.00;

//с колко голяма промяна иска да се намеси правителството
double const ADJUST = 0.10;

//достатъчно малка разлика (равно за double числата)
double const EPS = 0.0001;

//максимален брой на буквите в едно име
int const MAXL = 12;

//максимална дължина на стринга за име на училище
int const SSIZE = 4;

//енумерация представяща училищата 
//удобна е , защото имаме съпоставимост между имената на училищата и 
//естествените числа 0 ,1 ,2 ,3
enum School {

	SMG ,
	NTBG,
	IEG,
	NFSG
};

//структура представяща един ученик
struct Student {

	char name[MAXL];
	School school;
	double mark;
	
};

//help functions

//меню - оправляващата ни функция, чрез която викаме другите
void Menu();

//преобразува стринг в училище от изброимия тип ,който сме дефинирали
const char* School_toStr(School);

//прочита име на училище и връща стойност от 0 до 3 ако е валидно от енумерацията
//-1 ако името е невалидно
int ReadSchool();



//interface functions

//добавя нов запис за ученик в хранилището
void Add();


//изкарва на конзолата информация за най-добрия ученик
void BestStudent();

//записва във файл "Report.txt" информация за всички училища 
// във вида : ИМЕ_НА_УЧИЛИЩЕ - СРЕДЕН_УСПЕХ
void Report();

//по въведено име на училище , повишава успеха на всеки един ученик от хранилището 
//с предварително зададената стойност ADJUST
void Corrupt();