#pragma once

#include"Point.h"

//описваме нов тип - правоъгълник ,използвайки вече създанения тип точка
struct Rect{

	Point A;
	Point B;

};


//прочитаме от клавиятурата координатите на правоъгълника
void ReadRect(Rect&);

//принтим на екрана правоъгълник като са изпълнени следните особености :
// - ще считаме за начало на координатната система първият символ на новия ред , до който сме достигнали
// - х ще расте отляво надясно , а у отгоре надолу
// - разглеждаме само за х,у > 0
void PrintRect(const Rect&);

//връща истина ако един правоъгълник се намира в квадранта описан от горните условия
//лъжа в противен случай
//също така отчита дали двете точки , с които е зададен правоъгълника са валидни -
//тоест изпълняват изискването да нямат една и съща координата нито по х , нито по у
bool isValid(const Rect&);

//казва дали дадена точка се намира в даден правоъгълник
bool isInside(const Point&, const Rect&);

//казва дали два правоъгълника се пресичат
bool Collision(const Rect&, const Rect&);