#pragma once

//в този заглавен файл поставяме декларацията на класа Point 
//както и на всички негови член данни и методи

class Point{

//запазената дума private ,показва ,че тези променливи 
//са видими само вътрешно за класа , тоест ,външния свят не знае за тях ,
//а само обектите от типа Point
private:

	int x;
	int y;

	//тъй като всичките ни член данни са статични ( нямаме динамични данни и/или указатели)
	//не е наложително да разписваме ГОЛЯМАТА ЧЕТВОРКА(ще стане ясно точно какво значи този термин на следващото заниятите)
	//но без да сме разписали конструктор не можем да бъдем сигурни с какви стойности ще бъдат инициализирани x и y,
	//когато създадем обект от типа точка
public:

//с този конструктор , казваме ,че при създаване на нов обект искаме x и y да бъдат инициализирани със стойност 0
	Point() {

		x = 0;
		y = 0;

	}

//методите на класа Point - те са публични за да могат да бъдат използвани от клиентите на класа (в частност от самите нас)
public:
	
	//чете точка от конзолата
	void Read();

	//принти точка на конзолата 
	//забележете думичката const накрая на декларацията 
    //тя изрично показва ,че този метод не променя стойностите на член-данните	
	void Print()const;

	//връща разстоянието до (0,0)
	double DistToBeg()const;

	
	//тъй наречените сетъри и гетъри :
	//методи на класа , които дирекно манипулират скиртите(private) член-данни
	
	//връща стойността на х
	int GetX()const;

	//връща стойността на у
	int GetY()const;

	//задава стойности на координатите на една точка
	void Set(int, int);
};

