//задължителния гард , за да се предпазим от многократно включване
#ifndef __POINT_H__
#define __POINT_H__

//нов тип - точка представялваща две числа - координата по х и координата по у
struct Point{

	int x;
	int y;
};

//функция която чете от конзолата една точка, забележете ,че тук
//предаването по псевдоним е задължително , защото иначе ще прочетем от клавиятурата в локалното копие,
//а не в обекта,който сме подали като параметър на функцията
void readPnt(Point&);

//отпечатва на екрана координатите на дадена точка
//тук типът на параметъра е константен , защото няма да променяме самия обект
//референцията е желателна, за да избегнем излищно копиране
void printPnt(const Point&);

//връща разстоянието от точка до (0,0)
double pntToBegDist(const Point&);

//връща разстоянието от една точка до друга
double pntToPntDist(const Point&, const Point&);

#endif // !__POINT_H__