//задължителния гард , за да се предпазим от многократно включване
#pragma once 

//нов тип - точка представялваща две числа - координата по х и координата по у
struct Point{

	int x;
	int y;

};


//функция която чете от конзолата една точка, забележете ,че тук
//предаването по псевдоним е задължително , защото иначе ще прочетем от клавиятурата в локалното копие,
//а не в обекта,който сме подали като параметър на функцията
void ReadPnt(Point&);

//отпечатва на екрана координатите на дадена точка
//тук типът на параметъра е константен , защото няма да променяме самия обект
void PrintPnt(const Point&);

//връща разстоянието от точка до (0,0)
double PntToBegDist(const Point&);

//връща разстоянието от една точка до друга
double PntToPntDist(const Point&, const Point&);

//получава масив от точки и неговия размер
//връща индекса на точката най -близо до (0,0)
//връща -1 при невалидни аргументи
int ClosestPoint(Point*, int);




